Rhino.Geometry.SubDVertex.SurfacePoint
The SubD surface point
Returns:
SubD.SetVertexSurfacePoint(uint, Point3d)
SubD.InterpolateSurfacePoints(Point3d[])
SubD.InterpolateSurfacePoints(uint[], Point3d[])
SubDSurfaceInterpolator
Since: 7.1

Rhino.Geometry.SubDVertex.SetControlNetPoint(Rhino.Geometry.Point3d,System.Boolean)
Change the location of the "control net" point that this SubDVertex represents
position:
New position for the vertex' control net point.
bClearNeighborhoodCache:
If true, clear the evaluation cache in the faces around the modified vertex.
Returns:
true if the vertex' control net point was modified.
Remarks:
This method is provided to be able to set multiple control vertices, without clearing
the neighborhood cache everytime as the ControlNetPoint property setter does. When you
are done modifying your SubD, call subd.ClearEvaluationCache() to refresh
all caches.
Since: 8.0