Rhino.Geometry.MeshBooleanOptions.Tolerance
Gets or sets a tolerance value for intersections and overlaps.
Intersect.Intersection.MeshIntersectionsTolerancesCoefficient
The default value is Rhino.RhinoMath.ZeroTolerance*10. However, this is
only a reference value for testing and geometry developers should generally use the
document tolerance, multiplied by
Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
Since: 8.0