Rhino.DocObjects.ObjectAttributes.MaterialIndex
Gets or sets the material index.
If you want something simple and fast, set the index of
the rendering material.
Since: 5.0
RenderMaterial

Rhino.DocObjects.ObjectAttributes.MaterialSource
Determines if the simple material should come from the object or from it's layer.
High quality rendering plug-ins should use m_rendering_attributes.
Since: 5.0
RenderMaterial