Rhino.DocObjects.TextureProjectionModes.EnvironmentMapBox
Box type environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapLightProbe
Light probe type environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapSpherical
Spherical environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapCube
Cube type environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapVCrossCube
Vertical cross cube type environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapHCrossCube
Horizontal cross type environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapHemispherical
Hemispherical environtment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapEmap
Emap type environtment mapping