Rhino.Geometry.SubDCreationOptions.ConvexAndConcaveCornersAndInteriorCreases
Look for convex corners at sub-D vertices with 2 edges or fewer that have an
included angle ≤ 120 degrees.
Look for concave corners at sub-D vertices with 3 edge or more that have an
included angle ≥ 240 degrees.
Since: 8.0