Rhino.FileIO.File3dmMaterialTable.AddMaterial(Rhino.DocObjects.Material)
Adds a material to the model material table
material:
Returns: The material's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.